{
    "id": "67d50f56da1cae21c770da4d",
    "subject": "Biology",
    "level": "o_level",
    "year": "2024",
    "question_number_str": "5",
    "question_text": "Fig. 5.1 is a diagram of a pineapple growing on a pineapple plant.",
    "topic": "Plant Biology, Ecology, and Enzymes",
    "subtopic": "Plant Reproduction, Introduced Species, Enzyme Function",
    "difficulty": {
        "level": "Hard",
        "justification": "Combines multiple biological concepts (reproduction, ecology, enzymes) and application of knowledge"
    },
    "context_materials": "Fig. 5.1 is a diagram of a pineapple growing on a pineapple plant.\nFig. 5.2 shows the effect of changing pH on the activity of the enzymes found in bromelain.",
    "sub_questions": [
        {
            "sub_number": "a(i)",
            "text": "Pineapple plants can be grown on farms by removing the suckers from a parent plant and planting these in the ground to form new plants.\nState the type of reproduction used to grow pineapple plants in this way.",
            "marks": 1
        },
        {
            "sub_number": "a(ii)",
            "text": "State two advantages and two disadvantages of producing pineapple plants in this way.",
            "marks": 4
        },
        {
            "sub_number": "a(iii)",
            "text": "Pineapples are an important crop in Hawaii, USA. They were introduced to Hawaii from South America.\nBirds called hummingbirds pollinate pineapple flowers. If pollinated, pineapple fruits develop and they contain hard, inedible seeds. If not pollinated, pineapple fruits develop without seeds.\nHummingbirds are not found in Hawaii.\nSuggest why it is illegal to introduce hummingbirds into Hawaii.",
            "marks": 4
        },
        {
            "sub_number": "b(i)",
            "text": "Pineapples contain a mixture of protease enzymes called bromelain.\nWhen bromelain is added to its substrate, a product is formed.\nComplete the word equation to show the substrate and product.",
            "marks": 2
        },
        {
            "sub_number": "b(ii)",
            "text": "The effect of changing pH on the activity of the enzymes found in bromelain was investigated. The results of this investigation are shown in Fig. 5.2.\nTo assist digestion, some people swallow bromelain in the form of a powder with their food.\nUse the information in Fig. 5.2 and your knowledge of the human digestive system to discuss the effectiveness of using bromelain in this way.",
            "marks": 4
        }
    ],
    "tables": null,
    "marks": 15,
    "images": [
        {
            "label": "Fig. 5.1",
            "description": "Diagram of a pineapple plant",
            "url": "https://ibb.co/9kyd2cP9",
            "local_path": "src/data/cache/assets/biology/o_level/2024/q5_fig_51.png"
        },
        {
            "label": "Fig. 5.2",
            "description": "Graph showing enzyme activity vs pH",
            "url": "https://ibb.co/Df05qBsW",
            "local_path": "src/data/cache/assets/biology/o_level/2024/q5_fig_52.png"
        }
    ],
    "answer_ref": "5.json"
}