{
  "id": "67d50e9207d0b18ade1637a0",
  "subject": "Biology",
  "level": "o_level",
  "year": "2022",
  "question_number": "1",
  "text": "Enzymes are used in the fruit juice industry to help with the extraction of juice from fruit. You are going to investigate the extraction of juice from some crushed apple.",
  "images": [],
  "original_question": {
    "question_number": 1,
    "question_text": "Enzymes are used in the fruit juice industry to help with the extraction of juice from fruit. You are going to investigate the extraction of juice from some crushed apple.",
    "topic": "Biology",
    "subtopic": "Enzymes",
    "difficulty": {
      "level": "Medium",
      "justification": "Requires practical skills, data collection, analysis and experimental design"
    },
    "context_materials": [
      {
        "label": "Experimental Procedure",
        "content": "Detailed procedure for setting up and conducting enzyme experiment with crushed apple",
        "type": "text"
      }
    ],
    "sub_questions": [
      {
        "sub_number": "a",
        "text": "Complete the table headings by inserting the units and record the volume of juice in measuring cylinders A and B every 2 minutes for 10 minutes",
        "marks": 5
      },
      {
        "sub_number": "b",
        "text": "Use your results to suggest why the use of this enzyme is an advantage in the fruit juice industry",
        "marks": 3
      },
      {
        "sub_number": "c",
        "text": "Suggest reasons for stirring the contents of beakers A and B and using a clean stirring rod for beaker B",
        "marks": 2
      },
      {
        "sub_number": "d",
        "text": "Explain how the contents of beaker B act as a control",
        "marks": 2
      },
      {
        "sub_number": "e",
        "text": "Construct a line graph using given data and estimate volume at 5 minutes",
        "marks": 7
      },
      {
        "sub_number": "f",
        "text": "Design an experiment to investigate the effect of the enzyme on different varieties of apple",
        "marks": 6
      },
      {
        "sub_number": "g",
        "text": "Name testing solution, state temperature and conclusion for reducing sugar test",
        "marks": 3
      }
    ],
    "tables": [
      {
        "description": "Table for recording juice volumes over time"
      }
    ],
    "images": [
      {
        "description": "Diagram showing experimental setup with measuring cylinders and filters",
        "url": ""
      }
    ],
    "marks": 28
  },
  "answer_ref": "1.json"
}